### Terraform Plan Results

**Status:** ✅ Success

<details><summary>Show Plan</summary>

```terraform
data.external.modal_source_hash: Reading...
null_resource.github_bot_build[0]: Refreshing state... [id=2880417232394179789]
null_resource.control_plane_build: Refreshing state... [id=5177825186518628042]
null_resource.slack_bot_build[0]: Refreshing state... [id=7276194025334146546]
null_resource.web_app_cloudflare_build[0]: Refreshing state... [id=2795444936226608337]
module.session_index_kv.cloudflare_workers_kv_namespace.this: Refreshing state... [id=a3a5f0589c8e452183e7c1645c1edbf2]
module.slack_kv[0].cloudflare_workers_kv_namespace.this: Refreshing state... [id=053c04fbe3064c34a3e319095f9348ec]
cloudflare_d1_database.main: Refreshing state... [id=34eea68d-6269-43f1-9a46-12ac331c418a]
module.modal_app.null_resource.modal_secrets[0]: Refreshing state... [id=8620210873247373880]
module.modal_app.null_resource.modal_volume[0]: Refreshing state... [id=773310151658437616]
local_file.web_app_wrangler_production[0]: Refreshing state... [id=a046865c0bdc02128cf0ac72196c993c2a886e37]
data.external.modal_source_hash: Read complete after 0s [id=-]
module.modal_app.null_resource.modal_deploy: Refreshing state... [id=812095514079385623]
module.slack_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=df9761930b374f40a2a53454ccd763a5]
null_resource.d1_migrations: Refreshing state... [id=8931249073627896926]
module.control_plane_worker.cloudflare_worker.this: Refreshing state... [id=516182a7a44a429d9be0c8a44c9673e0]
module.control_plane_worker.cloudflare_worker_version.this: Refreshing state... [id=326b6c21-f83b-44e8-9be4-32cfebac46d4]
module.control_plane_worker.cloudflare_workers_deployment.this: Refreshing state... [id=0527903b-2a69-47ca-b0ad-91fadb59424c]
null_resource.web_app_cloudflare_deploy[0]: Refreshing state... [id=5068781928072487085]
module.github_bot_worker[0].cloudflare_worker.this: Refreshing state... [id=5e5cc1e189424a3fa86e1b3a81d69e2c]
null_resource.web_app_cloudflare_secrets[0]: Refreshing state... [id=4865928614052761634]
module.github_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=74b03db7-3720-4cdc-b65e-bc6391bf7390]
module.github_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=ce9fcae3-a675-486e-ba21-212791aee1f0]
module.slack_bot_worker[0].cloudflare_worker_version.this: Refreshing state... [id=6f0a7f73-fbc2-4d58-8c89-f128c286a682]
module.slack_bot_worker[0].cloudflare_workers_deployment.this: Refreshing state... [id=92c4612f-9362-4a89-96da-ae19a38cc2b6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # cloudflare_d1_database.main must be replaced
-/+ resource "cloudflare_d1_database" "main" {
      ~ created_at       = "2026-02-27T10:41:34Z" -> (known after apply)
      ~ file_size        = 122880 -> (known after apply)
      ~ id               = "34eea68d-6269-43f1-9a46-12ac331c418a" -> (known after apply)
      ~ name             = "open-inspect-noise-ai" -> "noise-ai" # forces replacement
      ~ num_tables       = 10 -> (known after apply)
      ~ uuid             = "34eea68d-6269-43f1-9a46-12ac331c418a" -> (known after apply)
      ~ version          = "production" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # local_file.web_app_wrangler_production[0] will be created
  + resource "local_file" "web_app_wrangler_production" {
      + content              = <<-EOT
            name = "noise-ai-web"
            main = ".open-next/worker.js"
            compatibility_date = "2025-08-15"
            compatibility_flags = ["nodejs_compat", "global_fetch_strictly_public"]
            
            [vars]
            GITHUB_CLIENT_ID = "Iv23li43buGlqc4zMdYr"
            NEXTAUTH_URL = "https://noise-ai-web.noise-xyz.workers.dev"
            CONTROL_PLANE_URL = "https://noise-ai-control-plane.noise-xyz.workers.dev"
            NEXT_PUBLIC_WS_URL = "wss://noise-ai-control-plane.noise-xyz.workers.dev"
            ALLOWED_USERS = ""
            ALLOWED_EMAIL_DOMAINS = ""
            
            [assets]
            directory = ".open-next/assets"
            binding = "ASSETS"
            
            [[services]]
            binding = "CONTROL_PLANE_WORKER"
            service = "noise-ai-control-plane"
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../..//packages/web/wrangler.production.toml"
      + id                   = (known after apply)
    }

  # null_resource.control_plane_build must be replaced
-/+ resource "null_resource" "control_plane_build" {
      ~ id       = "5177825186518628042" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-27T11:23:38Z" -> (known after apply)
        }
    }

  # null_resource.d1_migrations must be replaced
-/+ resource "null_resource" "d1_migrations" {
      ~ id       = "8931249073627896926" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "database_id"    = "34eea68d-6269-43f1-9a46-12ac331c418a" -> (known after apply)
            # (1 unchanged element hidden)
        }
    }

  # null_resource.github_bot_build[0] must be replaced
-/+ resource "null_resource" "github_bot_build" {
      ~ id       = "2880417232394179789" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-27T11:23:38Z" -> (known after apply)
        }
    }

  # null_resource.slack_bot_build[0] must be replaced
-/+ resource "null_resource" "slack_bot_build" {
      ~ id       = "7276194025334146546" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-27T11:23:38Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_build[0] must be replaced
-/+ resource "null_resource" "web_app_cloudflare_build" {
      ~ id       = "2795444936226608337" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-27T11:23:38Z" -> (known after apply)
        }
    }

  # null_resource.web_app_cloudflare_deploy[0] must be replaced
-/+ resource "null_resource" "web_app_cloudflare_deploy" {
      ~ id       = "5068781928072487085" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-27T11:23:52Z" -> (known after apply)
        }
    }

  # module.control_plane_worker.cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-02-27T11:23:39Z" -> (known after apply)
      ~ id                  = "326b6c21-f83b-44e8-9be4-32cfebac46d4" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/control-plane/dist/index.js" -> null
              - content_sha256 = "9d87b7775e74330932df35e3ac31c06ea4117008eb34f8c52c0b8c71438207a3" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/control-plane/dist/index.js"
              + content_sha256 = "bc0b36534b1af2a0d16c752f8262e584663f9b5dade700d21a022e295fa0ff4d"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 5 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.control_plane_worker.cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "robert@noise.xyz" -> (known after apply)
      ~ created_on   = "2026-02-27T11:23:45Z" -> (known after apply)
      ~ id           = "0527903b-2a69-47ca-b0ad-91fadb59424c" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "326b6c21-f83b-44e8-9be4-32cfebac46d4" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.github_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-02-27T11:23:46Z" -> (known after apply)
      ~ id                  = "74b03db7-3720-4cdc-b65e-bc6391bf7390" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/github-bot/dist/index.js" -> null
              - content_sha256 = "20273ed8717ec781b52de67137364676ccfc8504c13af5ba94c0639911a0bb8b" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/github-bot/dist/index.js"
              + content_sha256 = "8da330a9f7261bfe0c9b8cc17b6fb878eb78b55445b58c2a990b7cb4ba87f022"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 3 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 0 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.github_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "robert@noise.xyz" -> (known after apply)
      ~ created_on   = "2026-02-27T11:23:48Z" -> (known after apply)
      ~ id           = "ce9fcae3-a675-486e-ba21-212791aee1f0" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "74b03db7-3720-4cdc-b65e-bc6391bf7390" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.modal_app.null_resource.modal_deploy must be replaced
-/+ resource "null_resource" "modal_deploy" {
      ~ id       = "812095514079385623" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "app_name"        = "open-inspect" -> "noise-ai"
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "secrets_created" = (sensitive value)
          ~ "source_hash"     = "b7db8aa9772b9165f640aa5e333852ad2e913d8b4061c89081c6d13f8c447473" -> "b38e905df6537561cfccd7358419f242e51d67f9035b25bf12463ced27eeb20e"
          ~ "volume_created"  = "773310151658437616" -> (known after apply)
        }
    }

  # module.modal_app.null_resource.modal_secrets[0] must be replaced
-/+ resource "null_resource" "modal_secrets" {
      ~ id       = "8620210873247373880" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "secrets_hash" = (sensitive value)
        }
    }

  # module.modal_app.null_resource.modal_volume[0] must be replaced
-/+ resource "null_resource" "modal_volume" {
      ~ id       = "773310151658437616" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "volume_name" = "open-inspect-data" -> "noise-ai-data"
        }
    }

  # module.session_index_kv.cloudflare_workers_kv_namespace.this will be updated in-place
  ~ resource "cloudflare_workers_kv_namespace" "this" {
        id                    = "a3a5f0589c8e452183e7c1645c1edbf2"
      ~ supports_url_encoding = true -> (known after apply)
      ~ title                 = "open-inspect-session-index-noise-ai" -> "noise-ai-session-index-noise-ai"
        # (1 unchanged attribute hidden)
    }

  # module.slack_bot_worker[0].cloudflare_worker_version.this must be replaced
-/+ resource "cloudflare_worker_version" "this" {
      ~ annotations         = {
          + workers_message      = (known after apply)
          + workers_tag          = (known after apply)
          ~ workers_triggered_by = "create_version_api" -> (known after apply)
        } -> (known after apply)
      ~ bindings            = (sensitive value) # forces replacement
      ~ created_on          = "2026-02-27T11:23:43Z" -> (known after apply)
      ~ id                  = "6f0a7f73-fbc2-4d58-8c89-f128c286a682" -> (known after apply)
      + limits              = (known after apply)
      ~ modules             = [
          - { # forces replacement
              - content_file   = "../../..//packages/slack-bot/dist/index.js" -> null
              - content_sha256 = "78e737cc672c12c1dec6b521edbf4500170ac48da190530a8c3d0f9fc47f9cb2" -> null
              - content_type   = "application/javascript+module" -> null
              - name           = "index.js" -> null
            },
          + { # forces replacement
              + content_file   = "../../..//packages/slack-bot/dist/index.js"
              + content_sha256 = "610c3646cc85697525d60996776c14bd9cbc5744d617da32078c77375be6e6ed"
              + content_type   = "application/javascript+module"
              + name           = "index.js"
            },
        ]
      ~ number              = 3 -> (known after apply)
      ~ source              = "terraform" -> (known after apply)
      ~ startup_time_ms     = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.slack_bot_worker[0].cloudflare_workers_deployment.this must be replaced
-/+ resource "cloudflare_workers_deployment" "this" {
      ~ annotations  = {
          + workers_message      = (known after apply)
          ~ workers_triggered_by = "deployment" -> (known after apply)
        } -> (known after apply)
      ~ author_email = "robert@noise.xyz" -> (known after apply)
      ~ created_on   = "2026-02-27T11:23:44Z" -> (known after apply)
      ~ id           = "92c4612f-9362-4a89-96da-ae19a38cc2b6" -> (known after apply)
      ~ source       = "terraform" -> (known after apply)
      ~ versions     = [ # forces replacement
          ~ {
              ~ version_id = "6f0a7f73-fbc2-4d58-8c89-f128c286a682" -> (known after apply)
                # (1 unchanged attribute hidden)
            },
        ]
        # (3 unchanged attributes hidden)
    }

  # module.slack_kv[0].cloudflare_workers_kv_namespace.this will be updated in-place
  ~ resource "cloudflare_workers_kv_namespace" "this" {
        id                    = "053c04fbe3064c34a3e319095f9348ec"
      ~ supports_url_encoding = true -> (known after apply)
      ~ title                 = "open-inspect-slack-kv-noise-ai" -> "noise-ai-slack-kv-noise-ai"
        # (1 unchanged attribute hidden)
    }

Plan: 17 to add, 2 to change, 16 to destroy.

Changes to Outputs:
  ~ d1_database_id                 = "34eea68d-6269-43f1-9a46-12ac331c418a" -> (known after apply)
  ~ modal_app_name                 = "open-inspect" -> "noise-ai"
  ~ modal_health_url               = "https://robert-12949--open-inspect-api-health.modal.run" -> "https://robert-12949--noise-ai-api-health.modal.run"
  ~ verification_commands          = <<-EOT
        # 1. Health check control plane
        curl https://noise-ai-control-plane.workers.dev/health
        
        # 2. Health check Modal
      - curl https://robert-12949--open-inspect-api-health.modal.run
      + curl https://robert-12949--noise-ai-api-health.modal.run
        
        # 3. Verify web app deployment
        curl https://noise-ai-web.noise-xyz.workers.dev
        
        # 4. Test authenticated endpoint (should return 401)
        curl https://noise-ai-control-plane.workers.dev/sessions
    EOT

Error: Invalid index

  on checks.tf line 16, in check "vercel_url_matches":
  16:       module.web_app[0].production_url == local.web_app_url
    ├────────────────
    │ module.web_app is empty tuple

The given key does not identify an element in this collection value: the
collection has no elements.
::error::Terraform exited with code 1.
```

</details>

*Pushed by: @sunwrobert*